#Создать список из десяти целых чисел.
#Вывести на экран каждое число, увеличенное на 1.

spisok = [12, 34, 56, 4, 78, 67, 90, -45, 432, 1]
for i in spisok:
    print( i )
    
print('-' * 20)

#    Ввести с клавиатуры строку. 
# Вывести эту же строку вертикально: по одному символу на строку консоли.

stroka = 'moscow python'
for j in stroka:
    print( j )